lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
        /* USER CODE END EDS_Evt_Opcode */
        case EDS_CONNEX_HAND_CARA_2_NOTIFY_ENABLED_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("-- APPLICATION ROUTER : ENDDEVICEMGT NOTIFICATION ENABLED\r\n");
#endif
            /* USER CODE BEGIN EDS_STM_NOTIFY_ENABLED_EVT */
            P2P_Router_App_Context.state = EDS_CONNEX_HAND_CARA_2;
            HW_TS_Start(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_2, NAME_CHANGES_PERIODE);
            /* USER CODE END EDS_STM_NOTIFY_ENABLED_EVT */
            break;

        case EDS_CONNEX_HAND_CARA_2_NOTIFY_DISABLED_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("-- APPLICATION ROUTER : ENDDEVICEMGT NOTIFICATION DISABLED\r\n");
#endif
            /* USER CODE BEGIN EDS_STM_NOTIFY_DISABLED_EVT */
            HW_TS_Stop(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_2);
            /* USER CODE END EDS_STM_NOTIFY_DISABLED_EVT */
            break;
        case EDS_CONNEX_HAND_CARA_4_NOTIFY_ENABLED_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("-- APPLICATION ROUTER : ENDDEVICEMGT NOTIFICATION ENABLED\r\n");
#endif
            /* USER CODE BEGIN EDS_STM_NOTIFY_ENABLED_EVT */
            P2P_Router_App_Context.state = EDS_CONNEX_HAND_CARA_4;
            HW_TS_Start(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_4, NAME_CHANGES_PERIODE);
            /* USER CODE END EDS_STM_NOTIFY_ENABLED_EVT */
            break;

        case EDS_CONNEX_HAND_CARA_4_NOTIFY_DISABLED_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
            APP_DBG_MSG("-- APPLICATION ROUTER : ENDDEVICEMGT NOTIFICATION DISABLED\r\n");
#endif
            /* USER CODE BEGIN EDS_STM_NOTIFY_DISABLED_EVT */
            HW_TS_Stop(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_4);
            /* USER CODE END EDS_STM_NOTIFY_DISABLED_EVT */
            break;
        case EDS_CONNEX_HAND_CARA_3_WRITE_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
        	APP_DBG_MSG("-- GATT : WRITE CHAR INFO RECEIVED\n");
#endif
            /* USER CODE BEGIN EDS_CONNEX_HAND_CARA_3_WRITE_EVT */


        	switch(pNotification->DataTransfered.pPayload[0]){
				case CONNECT:
					P2P_Router_App_Context.PairingRequestStruct.status = CONNECTING;
					break;
				case DISCONNECT:
					//handle disconnection
					P2P_Router_App_Context.PairingRequestStruct.status = DISCONNECTING;
					break;
				default:
					break;
        	}
			memset(&P2P_Router_App_Context.PairingRequestStruct.SensorName, 0, sizeof(P2P_Router_App_Context.PairingRequestStruct.SensorName));

			for(int i=1; i<pNotification->DataTransfered.Length;i++){
            	P2P_Router_App_Context.PairingRequestStruct.SensorName[i-1] = pNotification->DataTransfered.pPayload[i];
            }

			UTIL_SEQ_SetTask(  1<<CFG_TASK_UPDATE_FLASH, CFG_SCH_PRIO_0 );


            /* USER CODE END EDS_CONNEX_HAND_CARA_3_WRITE_EVT */
            break;
        case EDS_CALIBRATION_CARA_1_WRITE_EVT:
#if(CFG_DEBUG_APP_TRACE != 0)
        	APP_DBG_MSG("-- GATT : WRITE CHAR INFO RECEIVED - CALIBRATION PARAMETERS -\n");
#endif
            /* USER CODE BEGIN EDS_CALIBRATION_CARA_1_WRITE_EVT */
            settings_t readSettings;
            settings_t settingsToWrite;

        	readFlash((uint8_t*)&readSettings);
        	settingsToWrite = readSettings;

        	settingsToWrite.cranksets.bigGear = pNotification->DataTransfered.pPayload[0];
        	settingsToWrite.cranksets.gear2 = pNotification->DataTransfered.pPayload[1];
        	settingsToWrite.cranksets.gear3 = pNotification->DataTransfered.pPayload[2];

        	settingsToWrite.sprockets.smallGear = pNotification->DataTransfered.pPayload[3];
        	settingsToWrite.sprockets.gear2 = pNotification->DataTransfered.pPayload[4];
        	settingsToWrite.sprockets.gear3 = pNotification->DataTransfered.pPayload[5];
        	settingsToWrite.sprockets.gear4 = pNotification->DataTransfered.pPayload[6];
        	settingsToWrite.sprockets.gear5 = pNotification->DataTransfered.pPayload[7];
        	settingsToWrite.sprockets.gear6 = pNotification->DataTransfered.pPayload[8];
        	settingsToWrite.sprockets.gear7 = pNotification->DataTransfered.pPayload[9];
        	settingsToWrite.sprockets.gear8 = pNotification->DataTransfered.pPayload[10];
        	settingsToWrite.sprockets.gear9 = pNotification->DataTransfered.pPayload[11];
        	settingsToWrite.sprockets.gear10 = pNotification->DataTransfered.pPayload[12];
        	settingsToWrite.sprockets.gear11 = pNotification->DataTransfered.pPayload[13];
        	settingsToWrite.sprockets.gear12 = pNotification->DataTransfered.pPayload[14];
        	settingsToWrite.sprockets.gear13 = pNotification->DataTransfered.pPayload[15];

        	settingsToWrite.preferences.ftp = (pNotification->DataTransfered.pPayload[16] << 8) + pNotification->DataTransfered.pPayload[17];

        	uint32_t temp_var = (pNotification->DataTransfered.pPayload[18] << 24) + (pNotification->DataTransfered.pPayload[19] << 16) +
        						(pNotification->DataTransfered.pPayload[20] << 8) + pNotification->DataTransfered.pPayload[21];
        	settingsToWrite.preferences.shiftingResponsiveness = (float) temp_var/10;
        	settingsToWrite.preferences.desiredRpm = pNotification->DataTransfered.pPayload[22];
        	settingsToWrite.preferences.desiredBpm = pNotification->DataTransfered.pPayload[23];

        	saveToFlash((uint8_t*) &settingsToWrite, sizeof(settingsToWrite));

        	//save in bikedata

        	bikeDataInformation.setting.cranksets.bigGear = settingsToWrite.cranksets.bigGear;
        	bikeDataInformation.setting.cranksets.gear2 = settingsToWrite.cranksets.gear2;
        	bikeDataInformation.setting.cranksets.gear3 = settingsToWrite.cranksets.gear3;

        	bikeDataInformation.setting.sprockets.smallGear = settingsToWrite.sprockets.smallGear;
        	bikeDataInformation.setting.sprockets.gear2 = settingsToWrite.sprockets.gear2;
        	bikeDataInformation.setting.sprockets.gear3 = settingsToWrite.sprockets.gear3;
        	bikeDataInformation.setting.sprockets.gear4 = settingsToWrite.sprockets.gear4;
        	bikeDataInformation.setting.sprockets.gear5 = settingsToWrite.sprockets.gear5;
        	bikeDataInformation.setting.sprockets.gear6 = settingsToWrite.sprockets.gear6;
        	bikeDataInformation.setting.sprockets.gear7 = settingsToWrite.sprockets.gear7;
        	bikeDataInformation.setting.sprockets.gear8 = settingsToWrite.sprockets.gear8;
        	bikeDataInformation.setting.sprockets.gear9 = settingsToWrite.sprockets.gear9;
        	bikeDataInformation.setting.sprockets.gear10 = settingsToWrite.sprockets.gear10;
        	bikeDataInformation.setting.sprockets.gear11 = settingsToWrite.sprockets.gear11;
        	bikeDataInformation.setting.sprockets.gear12 = settingsToWrite.sprockets.gear12;
        	bikeDataInformation.setting.sprockets.gear13 = settingsToWrite.sprockets.gear13;

        	bikeDataInformation.setting.preferences.ftp = settingsToWrite.preferences.ftp;
        	bikeDataInformation.setting.preferences.shiftingResponsiveness = settingsToWrite.preferences.shiftingResponsiveness;
        	bikeDataInformation.setting.preferences.desiredRpm = settingsToWrite.preferences.desiredRpm;
        	bikeDataInformation.setting.preferences.desiredBpm = settingsToWrite.preferences.desiredBpm;



            /* USER CODE END EDS_CALIBRATION_CARA_1_WRITE_EVT */
            break;

        default:
            /* USER CODE BEGIN EDS_Evt_Opcode_default */

